In [52]:
import pandas as pd
import re
import string

In [53]:
jobs = pd.read_csv('./datasets/jobs.csv')

In [54]:
jobs.head()

,Unnamed: 0,category,company,details,experience,industry,location,salary,title
0,0,Information Technology,Eliassen Group,\nOur client is dedicated to delivering best-i...,NaN,Other Great Industries,"201 South Tryon StreetCharlotte, NC 28202",NaN,data scientist
1,1,Information Technology,Rang Technologies,\nRoles and Responsibilities:\nThe client is i...,NaN,Computer Software,"Moline, IL",NaN,data scientist
2,2,Information Technology,Austin Fraser,\nAustin Fraser is working alongside a fantast...,NaN,Computer Software,"Austin, TX","$90,000.00 - $175,000.00 /Year",data scientist
3,3,Information Technology,FRG Technology Consulting,"\nData Scientist - Waltham, MA - $190K My clie...",NaN,Computer Software,"Waltham, MA","$190,000.00 - $200,000.00 /Year",data scientist
4,4,Information Technology,Roc Search Inc,"\nData Scientist - Education - $130,000With mi...",5+ years,Computer Software,"Austin, TX","$100,000.00 - $130,000.00 /Year",data scientist

In [55]:
# Drop 1st column
jobs.drop([jobs.columns[0]], axis=1, inplace=True)

In [56]:
# Drop duplicates based on details
jobs.drop_duplicates(['details'],inplace=True)

In [57]:
# Check for null values, 
jobs.isnull().sum()

category        33
company        172
details          1
experience    1069
industry         1
location         3
salary        1545
title            0
dtype: int64

In [58]:
# Start with column location
jobs[jobs['location'].isnull()]

,category,company,details,experience,industry,location,salary,title
341,NaN,NaN,NaN,NaN,NaN,NaN,NaN,data engineer
2707,"Information Technology, Management, Training",Federal-Mogul,\nFederal-Mogul is now hiring an LMS Manager i...,2+ years,"Computer Software, Training, Other Great Indus...",NaN,"$80,000.00 /Year",data architect
3622,"Manufacturing, Automotive, Other",Nemak,\n\n\nNemak is a leading provider of innovativ...,4-5 years,"Industrial, Other Great Industries, Electronics",NaN,NaN,stats programmer

In [59]:
# Drop null values in location
jobs.drop(jobs[jobs['location'].isnull()].index,inplace=True)

In [60]:
# Check for null values, 
jobs.isnull().sum()

category        32
company        171
details          0
experience    1068
industry         0
location         0
salary        1543
title            0
dtype: int64

In [61]:
# Create state column and drop location column
jobs['state'] = jobs['location'].str.extract(r'(\b[A-Z]{2}\b)', expand=False)

In [62]:
jobs.isnull().sum()

category        32
company        171
details          0
experience    1068
industry         0
location         0
salary        1543
title            0
state            1
dtype: int64

In [63]:
jobs[jobs['state'].isnull()]

,category,company,details,experience,industry,location,salary,title,state
2518,Information Technology,"Odyssey Information Services, Inc.",\nDescription:\n\nThe position will be respons...,8+ years,Employment - Recruiting - Staffing,"Fort Worth, Tx","$85,000.00 - $95,000.00 /Year",data architect,NaN

In [64]:
# Clean state column and drop location column
jobs.loc[jobs['state'].isnull(), 'state'] = 'TX'
jobs.drop('location', axis=1, inplace=True)

In [65]:
# Cleaning experience column.
# Create experience_ column by taking the mean
def experience_cleaner(experience):
    try:
        exp_yrs = re.findall(r'\d+', experience)
        return np.mean([float(i) for i in exp_yrs]) 
    except TypeError:
        pass
    return

jobs['experience_'] = jobs['experience'].apply(lambda x: experience_cleaner(x))
jobs.drop('experience', axis=1, inplace=True)

In [66]:
# Cleaning the salary
work_days = 251
work_hours = 9

# function returns mid point of a given salary range, else pass if no salary data available
# if salary quoted per year, return mid point of range
# if salary quoted per hour, return mid point of range * no. of work days in year * no. of work hours/day (annualising)
def salary_cleaner(salary_range):
    
    try:
        if 'Year' in salary_range:
            sal = re.findall(r'[0-9.]+',salary_range.replace('$','').replace(',',''))
            return np.mean([float(i) for i in sal])
        
        elif 'Hour' in salary_range:
            sal = re.findall(r'[0-9.]+',salary_range.replace('$','').replace(',',''))
            return np.mean([float(i) for i in sal]) * work_days * work_hours
        
    except TypeError:
        pass
    
    return

jobs['salary_'] = jobs['salary'].apply(lambda x: salary_cleaner(x))
jobs.drop('salary', axis=1, inplace=True)

In [67]:
jobs.head()

,category,company,details,industry,title,state,experience_,salary_
0,Information Technology,Eliassen Group,\nOur client is dedicated to delivering best-i...,Other Great Industries,data scientist,NC,NaN,NaN
1,Information Technology,Rang Technologies,\nRoles and Responsibilities:\nThe client is i...,Computer Software,data scientist,IL,NaN,NaN
2,Information Technology,Austin Fraser,\nAustin Fraser is working alongside a fantast...,Computer Software,data scientist,TX,NaN,132500.0
3,Information Technology,FRG Technology Consulting,"\nData Scientist - Waltham, MA - $190K My clie...",Computer Software,data scientist,MA,NaN,195000.0
4,Information Technology,Roc Search Inc,"\nData Scientist - Education - $130,000With mi...",Computer Software,data scientist,TX,5.0,115000.0

In [68]:
# Filling NaN with 'None'
jobs = jobs.fillna('None')

In [69]:
jobs.isnull().sum()

category       0
company        0
details        0
industry       0
title          0
state          0
experience_    0
salary_        0
dtype: int64

In [70]:
jobs['category'] = jobs['industry'].astype(str) + " "+ jobs['category']
jobs.drop('industry', axis=1, inplace=True)

In [71]:
jobs.head()

,category,company,details,title,state,experience_,salary_
0,Other Great Industries Information Technology,Eliassen Group,\nOur client is dedicated to delivering best-i...,data scientist,NC,None,None
1,Computer Software Information Technology,Rang Technologies,\nRoles and Responsibilities:\nThe client is i...,data scientist,IL,None,None
2,Computer Software Information Technology,Austin Fraser,\nAustin Fraser is working alongside a fantast...,data scientist,TX,None,132500
3,Computer Software Information Technology,FRG Technology Consulting,"\nData Scientist - Waltham, MA - $190K My clie...",data scientist,MA,None,195000
4,Computer Software Information Technology,Roc Search Inc,"\nData Scientist - Education - $130,000With mi...",data scientist,TX,5,115000

In [74]:
def clean(df,col_name):
    df[col_name] = df[col_name].apply(lambda x: x.replace('\n',' '))
    df[col_name] = df[col_name].apply(lambda x: x.lower().strip())
    df[col_name] = df[col_name].apply(lambda x:''.join([i for i in x if i not in string.punctuation]))

In [75]:
for i in ['category','details','company']:
    clean(jobs,i)

In [76]:
jobs['details'] = jobs['category'].astype(str) + " "+ jobs['details']
jobs.drop('category', axis=1, inplace=True)

In [77]:
jobs.head()

,company,details,title,state,experience_,salary_
0,eliassen group,other great industries information technology ...,data scientist,NC,None,None
1,rang technologies,computer software information technology roles...,data scientist,IL,None,None
2,austin fraser,computer software information technology austi...,data scientist,TX,None,132500
3,frg technology consulting,computer software information technology data ...,data scientist,MA,None,195000
4,roc search inc,computer software information technology data ...,data scientist,TX,5,115000

In [79]:
jobs.to_csv('jobs_clean.csv',encoding='utf-8')